import { LettersWithDiacritics } from './models/LettersWithDiacritics';

export const sinhalaLettersLevelBasic = [
  // Vowels
  'අ',
  'ආ',
  'ඇ',
  'ඉ',

  // Consonants
  'ක',
  'ග',
  'ඟ',
  'ජ',
  'ට',
  'ඩ',
  'ත',
  'ද',
  'න',
  'ඳ',
  'ප',
  'බ',
  'ම',
  'ඹ',
  'ය',
  'ර',
  'ල',
  'ව',
  'ෂ',
  'ස',
  'හ',
  'ළ',
];

export const sinhalaLettersLevelBasicForDiacritics: LettersWithDiacritics[] = [
  // Vowels
  { key: 'අ' },
  { key: 'ආ' },
  { key: 'ඇ' },
  { key: 'ඉ' },

  // Consonants
  { key: 'ක', diacritics: ['කා', 'කැ', 'කෑ', 'කි', 'කී', 'කු', 'කූ', 'කෙ', 'කේ'] },
  { key: 'ග', diacritics: ['ගා', 'ගැ', 'ගෑ', 'ගි', 'ගී', 'ගු', 'ගූ', 'ගෙ', 'ගේ'] },
  { key: 'ඟ' },
  { key: 'ජ', diacritics: ['ජා', 'ජැ', 'ජෑ', 'ජි', 'ජී', 'ජු', 'ජූ', 'ජෙ', 'ජේ'] },
  { key: 'ට', diacritics: ['ටා', 'ටැ', 'ටෑ', 'ටි', 'ටී', 'ටු', 'ටූ', 'ටෙ', 'ටේ'] },
  { key: 'ඩ', diacritics: ['ඩා', 'ඩැ', 'ඩෑ', 'ඩි', 'ඩී', 'ඩු', 'ඩූ', 'ඩෙ', 'ඩේ'] },
  { key: 'ත', diacritics: ['තා', 'තැ', 'තෑ', 'ති', 'තී', 'තු', 'තූ', 'තෙ', 'තේ'] },
  { key: 'ද', diacritics: ['දා', 'දැ', 'දෑ', 'දි', 'දී', 'දු', 'දූ', 'දෙ', 'දේ'] },
  { key: 'න', diacritics: ['නා', 'නැ', 'නෑ', 'නි', 'නී', 'නු', 'නූ', 'නෙ', 'නේ'] },
  { key: 'ඳ', diacritics: ['ඳා', 'ඳැ', 'ඳෑ', 'ඳි', 'ඳී', 'ඳු', 'ඳූ', 'ඳෙ', 'ඳේ'] },
  { key: 'ප', diacritics: ['පා', 'පැ', 'පෑ', 'පි', 'පී', 'පු', 'පූ', 'පෙ', 'පේ'] },
  { key: 'බ', diacritics: ['බා', 'බැ', 'බෑ', 'බි', 'බී', 'බු', 'බූ', 'බෙ', 'බේ'] },
  { key: 'ම', diacritics: ['මා', 'මැ', 'මෑ', 'මි', 'මී', 'මු', 'මූ', 'මෙ', 'මේ'] },
  { key: 'ඹ', diacritics: ['ඹා', 'ඹු'] },
  { key: 'ය', diacritics: ['යා', 'යැ', 'යෑ', 'යි', 'යී', 'යු', 'යූ', 'යෙ', 'යේ'] },
  { key: 'ර', diacritics: ['රා', 'රැ', 'රෑ', 'රි', 'රී', 'රු', 'රූ', 'රෙ', 'රේ'] },
  { key: 'ල', diacritics: ['ලා', 'ලැ', 'ලෑ', 'ලි', 'ලී', 'ලු', 'ලූ', 'ලෙ', 'ලේ'] },
  { key: 'ව', diacritics: ['වා', 'වැ', 'වෑ', 'වි', 'වී', 'වු', 'වූ', 'වෙ', 'වේ'] },
  { key: 'ෂ', diacritics: ['ෂා', 'ෂැ', 'ෂෑ', 'ෂි', 'ෂී', 'ෂු', 'ෂූ', 'ෂෙ', 'ෂේ'] },
  { key: 'ස', diacritics: ['සා', 'සැ', 'සෑ', 'සි', 'සී', 'සු', 'සූ', 'සෙ', 'සේ'] },
  { key: 'හ', diacritics: ['හා', 'හැ', 'හෑ', 'හි', 'හී', 'හු', 'හූ', 'හෙ', 'හේ'] },
  { key: 'ළ', diacritics: ['ළා', 'ළැ', 'ළෑ', 'ළි', 'ළී', 'ළු', 'ළූ', 'ළෙ', 'ළේ'] },
];
